import os
from config import Config

class Script(object):
  START_TXT = """<b>ʜɪ {}
  
ɪ'ᴍ ᴀ ᴀᴅᴠᴀɴᴄᴇᴅ ꜰᴏʀᴡᴀʀᴅ ʙᴏᴛ
ɪ ᴄᴀɴ ꜰᴏʀᴡᴀʀᴅ ᴀʟʟ ᴍᴇssᴀɢᴇ ꜰʀᴏᴍ ᴏɴᴇ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴀɴᴏᴛʜᴇʀ ᴄʜᴀɴɴᴇʟ</b>

**ᴄʟɪᴄᴋ ʜᴇʟᴘ ʙᴜᴛᴛᴏɴ ᴛᴏ ᴋɴᴏᴡ ᴍᴏʀᴇ ᴀʙᴏᴜᴛ ᴍᴇ**"""
  HELP_TXT = """<b><u>🔆 ʜᴇʟᴘ</b></u>

<u>**📚 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs:**</u>
<b>⏣ __ /start - ᴄʜᴇᴄᴋ ɪ'ᴍ ᴀʟɪᴠᴇ__ 
⏣ __ /forward - ꜰᴏʀᴡᴀʀᴅ ᴍᴇssᴀɢᴇs__
⏣ __ /settings - ᴄᴏɴꜰɪɢᴜʀᴇ ʏᴏᴜʀ sᴇᴛᴛɪɴɢs__
⏣ __ /unequify - ᴅᴇʟᴇᴛᴇ ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴍᴇᴅɪᴀ ᴍᴇssᴀɢᴇs ɪɴ ᴄʜᴀᴛs__
⏣ __ /stop - sᴛᴏᴘ ʏᴏᴜʀ ᴏɴɢᴏɪɴɢ ᴛᴀsᴋs__
⏣ __ /reset - ʀᴇsᴇᴛ ʏᴏᴜʀ sᴇᴛᴛɪɴɢs__</b>

<b><u>💢 ꜰᴇᴀᴛᴜʀᴇs:</b></u>
<b>► __ꜰᴏʀᴡᴀʀᴅ ᴍᴇssᴀɢᴇ ꜰʀᴏᴍ ᴘᴜʙʟɪᴄ ᴄʜᴀɴɴᴇʟ ᴛᴏ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴡɪᴛʜᴏᴜᴛ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ. ɪꜰ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ɪs ᴘʀɪᴠᴀᴛᴇ ɴᴇᴇᴅ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ, ɪꜰ ʏᴏᴜ ᴄᴀɴ'ᴛ ɢɪᴠᴇ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ ᴛʜᴇɴ ᴜsᴇ ᴜsᴇʀʙᴏᴛ, ʙᴜᴛ ɪɴ ᴜsᴇʀʙᴏᴛ ᴛʜᴇʀᴇ ɪs ᴀ ᴄʜᴀɴᴄᴇ ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴀᴄᴄᴏᴜɴᴛ ʙᴀɴ sᴏ ᴜsᴇ ꜰᴀᴋᴇ ᴀᴄᴄᴏᴜɴᴛ__
► __ᴄᴜsᴛᴏᴍ ᴄᴀᴘᴛɪᴏɴ__
► __ᴄᴜsᴛᴏᴍ ʙᴜᴛᴛᴏɴ__
► __sᴋɪᴘ ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴍᴇssᴀɢᴇs__
► __ꜰɪʟᴛᴇʀ ᴛʏᴘᴇ ᴏꜰ ᴍᴇssᴀɢᴇs__</b>
"""
  
  HOW_USE_TXT = """<b><u>⚠️ ʙᴇꜰᴏʀᴇ ꜰᴏʀᴡᴀʀᴅɪɴɢ:</b></u>
<b>► __ᴀᴅᴅ ᴀ ʙᴏᴛ ᴏʀ ᴜsᴇʀʙᴏᴛ__
► __ᴀᴅᴅ ᴀᴛʟᴇᴀsᴛ ᴏɴᴇ ᴛᴏ ᴄʜᴀɴɴᴇʟ__ `(ʏᴏᴜʀ ʙᴏᴛ/ᴜsᴇʀʙᴏᴛ ᴍᴜsᴛ ʙᴇ ᴀᴅᴍɪɴ ɪɴ ᴛʜᴇʀᴇ)`
► __ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ᴄʜᴀᴛs ᴏʀ ʙᴏᴛs ʙʏ ᴜsɪɴɢ /sᴇᴛᴛɪɴɢs__
► __ɪꜰ ᴛʜᴇ **ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ** ɪs ᴘʀɪᴠᴀᴛᴇ ʏᴏᴜʀ ᴜsᴇʀʙᴏᴛ ᴍᴜsᴛ ʙᴇ ᴍᴇᴍʙᴇʀ ɪɴ ᴛʜᴇʀᴇ ᴏʀ ʏᴏᴜʀ ʙᴏᴛ ᴍᴜsᴛ ɴᴇᴇᴅ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ ɪɴ ᴛʜᴇʀᴇ ᴀʟsᴏ__
► __ᴛʜᴇɴ ᴜsᴇ /ꜰᴏʀᴡᴀʀᴅ ᴛᴏ ꜰᴏʀᴡᴀʀᴅ ᴍᴇssᴀɢᴇs__

► ʜᴏᴡ ᴛᴏ ᴜsᴇ ᴍᴇ [ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ](https://youtu.be/wO1FE-lf35I)</b>"""
  
  ABOUT_TXT = """<b>
╔════❰ ꜰᴏʀᴡᴀʀᴅ ʙᴏᴛ ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼📃ʙᴏᴛ : [ꜰᴏʀᴡᴀʀᴅ ʙᴏᴛ](https://t.me/VJForwardBot)
║┣⪼👦ᴄʀᴇᴀᴛᴏʀ : [ᴋɪɴɢ ᴠᴊ 👑](https://t.me/kingvj01)
║┣⪼🤖ᴜᴘᴅᴀᴛᴇ : [ᴠᴊ ʙᴏᴛᴢ](https://t.me/vj_botz)
║┣⪼📡ʜᴏsᴛᴇᴅ ᴏɴ : sᴜᴘᴇʀ ꜰᴀsᴛ
║┣⪼🗣️ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ3
║┣⪼📚ʟɪʙʀᴀʀʏ : ᴘʏʀᴏɢʀᴀᴍ ɢᴀᴛʜᴇʀ 2.11.0 
║┣⪼🗒️ᴠᴇʀsɪᴏɴ : 0.18.3
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁۪۪
</b>"""
  STATUS_TXT = """
╔════❰ ʙᴏᴛ sᴛᴀᴛᴜs  ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼**⏳ ʙᴏᴛ ᴜᴘᴛɪᴍᴇ:**`{}`
║┃
║┣⪼**👱 ᴛᴏᴛᴀʟ ᴜsᴇʀs:** `{}`
║┃
║┣⪼**🤖 ᴛᴏᴛᴀʟ ʙᴏᴛ:** `{}`
║┃
║┣⪼**🔃 ꜰᴏʀᴡᴀʀᴅɪɴɢs:** `{}`
║┃
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁۪۪
"""
  FORWARD_START_TXT = """<b>ꜰᴏʀᴡᴀʀᴅɪɴɢ sᴛᴀʀᴛᴇᴅ🔥</b>

<b>ʙᴏᴛ ɴᴀᴍᴇ:</b> {}
<b>ʙᴏᴛ ɪᴅ:</b> {}
<b>ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ:</b> {}
<b>ᴛᴏ ᴄʜᴀɴɴᴇʟ:</b> {}"""
  
  FORWARD_CANCEL_TXT = """<b>❌ ꜰᴏʀᴡᴀʀᴅɪɴɢ ᴄᴀɴᴄᴇʟʟᴇᴅ</b>

<b>ʙᴏᴛ ɴᴀᴍᴇ:</b> {}
<b>ʙᴏᴛ ɪᴅ:</b> {}
<b>ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ:</b> {}
<b>ᴛᴏ ᴄʜᴀɴɴᴇʟ:</b> {}"""

  FROM_MSG = "<b>❪ sᴇᴛ sᴏᴜʀᴄᴇ ᴄʜᴀᴛ ❫\n\nꜰᴏʀᴡᴀʀᴅ ᴛʜᴇ ʟᴀsᴛ ᴍᴇssᴀɢᴇ ᴏʀ ʟᴀsᴛ ᴍᴇssᴀɢᴇ ʟɪɴᴋ ᴏꜰ sᴏᴜʀᴄᴇ ᴄʜᴀᴛ.\n/cancel - ᴄᴀɴᴄᴇʟ ᴛʜɪs ᴘʀᴏᴄᴇss</b>"
  TO_MSG = "<b>❪ ᴄʜᴏᴏsᴇ ᴛᴀʀɢᴇᴛ ᴄʜᴀᴛ ❫\n\nᴄʜᴏᴏsᴇ ʏᴏᴜʀ ᴛᴀʀɢᴇᴛ ᴄʜᴀᴛ ꜰʀᴏᴍ ᴛʜᴇ ɢɪᴠᴇɴ ʙᴜᴛᴛᴏɴs.\n/cancel - ᴄᴀɴᴄᴇʟ ᴛʜɪs ᴘʀᴏᴄᴇss</b>"
  SKIP_MSG = "<b>❪ sᴇᴛ ᴍᴇssᴀɢᴇ sᴋɪᴘɪɴɢ ɴᴜᴍʙᴇʀ ❫</b>\n\n<b>sᴋɪᴘ ᴛʜᴇ ᴍᴇssᴀɢᴇ ᴀs ᴍᴜᴄʜ ᴀs ʏᴏᴜ ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴜᴍʙᴇʀ ᴀɴᴅ ᴛʜᴇ ʀᴇsᴛ ᴏꜰ ᴛʜᴇ ᴍᴇssᴀɢᴇ ᴡɪʟʟ ʙᴇ ꜰᴏʀᴡᴀʀᴅᴇᴅ\nᴅᴇꜰᴀᴜʟᴛ sᴋɪᴘ ɴᴜᴍʙᴇʀ =</b> <code>0</code>\n<code>ᴇɢ: ʏᴏᴜ ᴇɴᴛᴇʀ 0 = 0 ᴍᴇssᴀɢᴇ sᴋɪᴘᴇᴅ\n ʏᴏᴜ ᴇɴᴛᴇʀ 5 = 5 ᴍᴇssᴀɢᴇ sᴋɪᴘᴇᴅ</code>\n/cancel <b>- ᴄᴀɴᴄᴇʟ ᴛʜɪs ᴘʀᴏᴄᴇss</b>"
  CANCEL = "<b>ᴘʀᴏᴄᴇss ᴄᴀɴᴄᴇʟʟᴇᴅ sᴜᴄᴄᴇꜰᴜʟʟʏ !</b>"
  BOT_DETAILS = "<b><u>📄 ʙᴏᴛ ᴅᴇᴛᴀɪʟs</b></u>\n\n<b>➣ ɴᴀᴍᴇ:</b> <code>{}</code>\n<b>➣ ʙᴏᴛ ɪᴅ:</b> <code>{}</code>\n<b>➣ ᴜsᴇʀɴᴀᴍᴇ:</b> @{}"
  USER_DETAILS = "<b><u>📄 ᴜsᴇʀʙᴏᴛ ᴅᴇᴛᴀɪʟs</b></u>\n\n<b>➣ ɴᴀᴍᴇ:</b> <code>{}</code>\n<b>➣ ᴜsᴇʀ ɪᴅ:</b> <code>{}</code>\n<b>➣ ᴜsᴇʀɴᴀᴍᴇ:</b> @{}"       
  
  TEXTs = """
╔════❰ ꜰᴏʀᴡᴀʀᴅ sᴛᴀᴛᴜs  ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼<b>🕵 ꜰᴇᴛᴄʜᴇᴅ ᴍsɢ :</b> <code>{}</code>
║┃
║┣⪼<b>✅ sᴜᴄᴄᴇssꜰᴜʟʟʏ ꜰᴡᴅ :</b> <code>{}</code>
║┃
║┣⪼<b>👥 ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴍsɢ :</b> <code>{}</code>
║┃
║┣⪼<b>🗑 ᴅᴇʟᴇᴛᴇᴅ ᴍsɢ :</b> <code>{}</code>
║┃
║┣⪼<b>🪆 sᴋɪᴘᴘᴇᴅ ᴍsɢ :</b> <code>{}</code>
║┃
║┣⪼<b>🔁 ꜰɪʟᴛᴇʀᴇᴅ ᴍsɢ :</b> <code>{}</code>
║┃
║┣⪼<b>📊 ᴄᴜʀʀᴇɴᴛ sᴛᴀᴛᴜs:</b> <code>{}</code>
║┃
║┣⪼<b>𖨠 ᴘᴇʀᴄᴇɴᴛᴀɢᴇ:</b> <code>{}</code> %
║╰━━━━━━━━━━━━━━━➣ 
╚════❰ {} ❱══❍⊱❁۪۪
"""


  TEXT = """<b>━━━━━ ❰ ꜰᴏʀᴡᴀʀᴅ sᴛᴀᴛᴜs ❱ ━━━━━</b>

<b>🤖 ʙᴏᴛ ɴᴀᴍᴇ      :</b>   <code>{}</code>
<b>🆔 ʙᴏᴛ ɪᴅ          :</b>   <code>{}</code>
<b>#️⃣ ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ  :</b>   <code>{}</code>
<b>#️⃣ ᴛᴏ ᴄʜᴀɴɴᴇʟ    :</b>   <code>{}</code>

<b>🧾 ᴛᴏᴛᴀʟ ᴍᴇssᴀɢᴇs :</b>   <code>{}</code>

<b>📥 ꜰᴇᴛᴄʜᴇᴅ         :</b>   <code>{}</code>
<b>🔁 ꜰᴏʀᴡᴀʀᴅᴇᴅ    :</b>   <code>{}</code>
<b>⏳ ʀᴇᴍᴀɪɴɪɴɢ     :</b>   <code>{}</code>

<b>🔂 ᴅᴜᴘʟɪᴄᴀᴛᴇs   :</b>   <code>{}</code>
<b>🗑️ ᴅᴇʟᴇᴛᴇᴅ         :</b>   <code>{}</code>
<b>⛔ sᴋɪᴘᴘᴇᴅ         :</b>   <code>{}</code>
<b>🔎 ꜰɪʟᴛᴇʀᴇᴅ        :</b>   <code>{}</code>

<b>⚙️ ᴄᴜʀʀᴇɴᴛ        :</b>   <code>{}</code>
<b>🕒 ᴇsᴛ ᴛɪᴍᴇ        :</b>   <code>{}</code>

<b>━━━━━━ ❰ {} ❱ ━━━━━━</b>"""




  DUPLICATE_TEXT = """<b>━━━━━ ❰ ᴜɴᴇǫᴜɪꜰʏ sᴛᴀᴛᴜs ❱ ━━━━━</b>

<b>ꜰᴇᴛᴄʜᴇᴅ ꜰɪʟᴇs:</b> <code>{}</code>

<b>ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴅᴇʟᴇᴛᴇᴅ:</b> <code>{}</code> 

<b>━━━━━━ ❰ {} ❱ ━━━━━━</b>"""


  DOUBLE_CHECK = """<b><u>ᴅᴏᴜʙʟᴇ ᴄʜᴇᴄᴋɪɴɢ ⚠️</b></u>
<code>ʙᴇꜰᴏʀᴇ ꜰᴏʀᴡᴀʀᴅɪɴɢ ᴛʜᴇ ᴍᴇssᴀɢᴇs ᴄʟɪᴄᴋ ᴛʜᴇ ʏᴇs ʙᴜᴛᴛᴏɴ ᴏɴʟʏ ᴀꜰᴛᴇʀ ᴄʜᴇᴄᴋɪɴɢ ᴛʜᴇ ꜰᴏʟʟᴏᴡɪɴɢ</code>

<b>★ ʏᴏᴜʀ ʙᴏᴛ:</b> [{botname}](t.me/{botuname})
<b>★ ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ:</b> `{from_chat}`
<b>★ ᴛᴏ ᴄʜᴀɴɴᴇʟ:</b> `{to_chat}`
<b>★ sᴋɪᴘ ᴍᴇssᴀɢᴇs:</b> `{skip}`

<i>° [{botname}](t.me/{botuname}) ᴍᴜsᴛ ʙᴇ ᴀᴅᴍɪɴ ɪɴ **ᴛᴀʀɢᴇᴛ ᴄʜᴀᴛ**</i> (`{to_chat}`)
<i>° ɪꜰ ᴛʜᴇ **sᴏᴜʀᴄᴇ ᴄʜᴀᴛ** ɪs ᴘʀɪᴠᴀᴛᴇ ʏᴏᴜʀ ᴜsᴇʀʙᴏᴛ ᴍᴜsᴛ ʙᴇ ᴍᴇᴍʙᴇʀ ᴏʀ ʏᴏᴜʀ ʙᴏᴛ ᴍᴜsᴛ ʙᴇ ᴀᴅᴍɪɴ ɪɴ ᴛʜᴇʀᴇ ᴀʟsᴏ</b></i>

<b>ɪꜰ ᴛʜᴇ ᴀʙᴏᴠᴇ ɪs ᴄʜᴇᴄᴋᴇᴅ ᴛʜᴇɴ ᴛʜᴇ ʏᴇs ʙᴜᴛᴛᴏɴ ᴄᴀɴ ʙᴇ ᴄʟɪᴄᴋᴇᴅ</b>"""
  
  SETTINGS_TXT = """<b>ᴄʜᴀɴɢᴇ ʏᴏᴜʀ sᴇᴛᴛɪɴɢs ᴀs ʏᴏᴜʀ ᴡɪsʜ</b>"""