import os
from config import Config

class Script(object):
  START_TXT = """<b>ʜɪ {}
  
ɪ'ᴍ ᴀ ᴀᴅᴠᴀɴᴄᴇᴅ ꜰᴏʀᴡᴀʀᴅ ʙᴏᴛ
ɪ ᴄᴀɴ ꜰᴏʀᴡᴀʀᴅ ᴀʟʟ ᴍᴇssᴀɢᴇ ꜰʀᴏᴍ ᴏɴᴇ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴀɴᴏᴛʜᴇʀ ᴄʜᴀɴɴᴇʟ</b>

**ᴄʟɪᴄᴋ ʜᴇʟᴘ ʙᴜᴛᴛᴏɴ ᴛᴏ ᴋɴᴏᴡ ᴍᴏʀᴇ ᴀʙᴏᴜᴛ ᴍᴇ**"""
  HELP_TXT = """<b><u>🔆 ʜᴇʟᴘ</b></u>

<u>**📚 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs:**</u>
⏣ __ /start - ᴄʜᴇᴄᴋ ɪ'ᴍ ᴀʟɪᴠᴇ__ 
⏣ __ /forward - ꜰᴏʀᴡᴀʀᴅ ᴍᴇssᴀɢᴇs__
⏣ __ /settings - ᴄᴏɴꜰɪɢᴜʀᴇ ʏᴏᴜʀ sᴇᴛᴛɪɴɢs__
⏣ __ /unequify - ᴅᴇʟᴇᴛᴇ ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴍᴇᴅɪᴀ ᴍᴇssᴀɢᴇs ɪɴ ᴄʜᴀᴛs__
⏣ __ /stop - sᴛᴏᴘ ʏᴏᴜʀ ᴏɴɢᴏɪɴɢ ᴛᴀsᴋs__
⏣ __ /ongoing - sᴇᴇ ᴏɴɢᴏɪɴɢ ғᴏʀᴡᴀʀᴅ sᴛᴀᴛᴜs__
⏣ __ /reset - ʀᴇsᴇᴛ ʏᴏᴜʀ sᴇᴛᴛɪɴɢs__
⏣ __ /my_plan - ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴄᴜʀʀᴇɴᴛ ᴘʟᴀɴ__
⏣ __ /plans - sᴇᴇ ᴀᴠᴀɪʟᴀʙʟᴇ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴs__
⏣ __ /add_premium - (ᴏᴡɴᴇʀ) ᴀᴅᴅ ᴜsᴇʀ ᴛᴏ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴ__
⏣ __ /remove_premium - (ᴏᴡɴᴇʀ) ʀᴇᴍᴏᴠᴇ ᴜsᴇʀ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴ__

<b><u>💢 ꜰᴇᴀᴛᴜʀᴇs:</b></u>
<b>► __ꜰᴏʀᴡᴀʀᴅ ᴍᴇssᴀɢᴇ ꜰʀᴏᴍ ᴘᴜʙʟɪᴄ ᴄʜᴀɴɴᴇʟ ᴛᴏ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴡɪᴛʜᴏᴜᴛ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ. ɪꜰ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ɪs ᴘʀɪᴠᴀᴛᴇ ɴᴇᴇᴅ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ, ɪꜰ ʏᴏᴜ ᴄᴀɴ'ᴛ ɢɪᴠᴇ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ ᴛʜᴇɴ ᴜsᴇ ᴜsᴇʀʙᴏᴛ, ʙᴜᴛ ɪɴ ᴜsᴇʀʙᴏᴛ ᴛʜᴇʀᴇ ɪs ᴀ ᴄʜᴀɴᴄᴇ ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴀᴄᴄᴏᴜɴᴛ ʙᴀɴ sᴏ ᴜsᴇ ꜰᴀᴋᴇ ᴀᴄᴄᴏᴜɴᴛ__</b>
► __ᴄᴜsᴛᴏᴍ ᴄᴀᴘᴛɪᴏɴ__
► __ᴄᴜsᴛᴏᴍ ʙᴜᴛᴛᴏɴ__
► __sᴋɪᴘ ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴍᴇssᴀɢᴇs__
► __ꜰɪʟᴛᴇʀ ᴛʏᴘᴇ ᴏꜰ ᴍᴇssᴀɢᴇs__

<b><u>🌟 ᴘʀᴇᴍɪᴜᴍ ꜰᴇᴀᴛᴜʀᴇs:</b></u>
► __Rᴇɢᴇx ʙᴀsᴇᴅ ғɪʟᴛᴇʀɪɴɢ__
► __ᴄᴀᴘᴛɪᴏɴ ᴡᴏʀᴅ ʀᴇᴘʟᴀᴄᴇᴍᴇɴᴛ__
► __ᴘᴇʀsɪsᴛᴇɴᴛ sᴋɪᴘ ᴅᴜᴘʟɪᴄᴀᴛɪᴏɴ__


"""
  
  PLANS_TXT = """<b>🌟 ᴀᴠᴀɪʟᴀʙʟᴇ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴs 🌟</b>

Here are the available plans to enhance your experience. Contact the bot owner to upgrade!

🥉 **Bronze Plan**
- **Price:** 30₹
- **Forward Tasks:** `{bronze_limit}`
- **Forward Speed:** `Normal`
- **Premium Features:** `Included`
- **Premium Duration:** `30 days`

🥈 **Silver Plan**
- **Price:** 50₹
- **Forward Tasks:** `{silver_limit}`
- **Forward Speed:** `Slightly Fast`
- **Premium Features:** `Included`
- **Premium Duration:** `45 days`

🥇 **Gold Plan**
- **Price:** 70₹
- **Forward Tasks:** `{gold_limit}`
- **Forward Speed:** `Fast`
- **Premium Features:** `Included`
- **Premium Duration:** `60 days`

**Free Plan:**
- **Forward Tasks:** `{default_limit}`
- **Forward Speed:** `Normal`
- **Premium Features:** `Not Included`
"""

  HOW_USE_TXT = """<b><u>⚠️ ʙᴇꜰᴏʀᴇ ꜰᴏʀᴡᴀʀᴅɪɴɢ:</b></u>
<b>► __ᴀᴅᴅ ᴀ ʙᴏᴛ ᴏʀ ᴜsᴇʀʙᴏᴛ__
► __ᴀᴅᴅ ᴀᴛʟᴇᴀsᴛ ᴏɴᴇ ᴛᴏ ᴄʜᴀɴɴᴇʟ__ `(ʏᴏᴜʀ ʙᴏᴛ/ᴜsᴇʀʙᴏᴛ ᴍᴜsᴛ ʙᴇ ᴀᴅᴍɪɴ ɪɴ ᴛʜᴇʀᴇ)`
► __ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ᴄʜᴀᴛs ᴏʀ ʙᴏᴛs ʙʏ ᴜsɪɴɢ /sᴇᴛᴛɪɴɢs__
► __ɪꜰ ᴛʜᴇ **ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ** ɪs ᴘʀɪᴠᴀᴛᴇ ʏᴏᴜʀ ᴜsᴇʀʙᴏᴛ ᴍᴜsᴛ ʙᴇ ᴍᴇᴍʙᴇʀ ɪɴ ᴛʜᴇʀᴇ ᴏʀ ʏᴏᴜʀ ʙᴏᴛ ᴍᴜsᴛ ɴᴇᴇᴅ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ ɪɴ ᴛʜᴇʀᴇ ᴀʟsᴏ__
► __ᴛʜᴇɴ ᴜsᴇ /ꜰᴏʀᴡᴀʀᴅ ᴛᴏ ꜰᴏʀᴡᴀʀᴅ ᴍᴇssᴀɢᴇs__</b>"""
  
  ABOUT_TXT = """<b>━━━━━ ❰ ꜰᴏʀᴡᴀʀᴅ ʙᴏᴛ ❱ ━━━━━

📃ʙᴏᴛ : [ꜰᴏʀᴡᴀʀᴅ ʙᴏᴛ](https://t.me/Blaze_forward_bot)
👦ᴄʀᴇᴀᴛᴏʀ : [ᴄʟɪᴄᴋ ʜᴇʀᴇ 👑](https://t.me/bharath_boy)
🤖ᴜᴘᴅᴀᴛᴇ : [ᴄʟɪᴄᴋ ʜᴇʀᴇ](https://t.me/Blaze_updateZ)
📡ʜᴏsᴛᴇᴅ ᴏɴ : sᴜᴘᴇʀ ꜰᴀsᴛ
🗣️ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ3
📚ʟɪʙʀᴀʀʏ : ᴘʏʀᴏғᴏʀᴋ 2.3.68
🗒️ᴠᴇʀsɪᴏɴ : BETA
━━━━━━━━━━━━━━━
</b>"""



  STATUS_TXT = """━━━━━ ❰ ʙᴏᴛ sᴛᴀᴛᴜs  ❱ ━━━━━
**⏳ ʙᴏᴛ ᴜᴘᴛɪᴍᴇ:**`{}`

**👱 ᴛᴏᴛᴀʟ ᴜsᴇʀs:** `{}`

**🤖 ᴛᴏᴛᴀʟ ʙᴏᴛ:** `{}`

**🔃 ꜰᴏʀᴡᴀʀᴅɪɴɢs:** `{}`

━━━━━━━━━━━━━━━

"""
  FORWARD_START_TXT = """<b>ꜰᴏʀᴡᴀʀᴅɪɴɢ sᴛᴀʀᴛᴇᴅ🔥</b>

<b>ꜰᴏʀᴡᴀʀᴅ ɪᴅ:</b> {}
<b>ʙᴏᴛ ɴᴀᴍᴇ:</b> {}
<b>ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ:</b> {}
<b>ᴛᴏ ᴄʜᴀɴɴᴇʟ:</b> {}"""
  
  FORWARD_CANCEL_TXT = """<b>❌ ꜰᴏʀᴡᴀʀᴅɪɴɢ ᴄᴀɴᴄᴇʟʟᴇᴅ</b>

<b>ꜰᴏʀᴡᴀʀᴅ ɪᴅ:</b> {}
<b>ʙᴏᴛ ɴᴀᴍᴇ:</b> {}
<b>ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ:</b> {}
<b>ᴛᴏ ᴄʜᴀɴɴᴇʟ:</b> {}"""

  FROM_MSG = """<b>❪ sᴇᴛ sᴏᴜʀᴄᴇ ᴄʜᴀᴛ ❫

ꜰᴏʀᴡᴀʀᴅ ᴛʜᴇ ʟᴀsᴛ ᴍᴇssᴀɢᴇ ᴏʀ ʟᴀsᴛ ᴍᴇssᴀɢᴇ ʟɪɴᴋ ᴏꜰ sᴏᴜʀᴄᴇ ᴄʜᴀᴛ.
/cancel - ᴄᴀɴᴄᴇʟ ᴛʜɪs ᴘʀᴏᴄᴇss</b>"""

  TO_MSG = """<b>❪ ᴄʜᴏᴏsᴇ ᴛᴀʀɢᴇᴛ ᴄʜᴀᴛ ❫

ᴄʜᴏᴏsᴇ ʏᴏᴜʀ ᴛᴀʀɢᴇᴛ ᴄʜᴀᴛ ꜰʀᴏᴍ ᴛʜᴇ ɢɪᴠᴇɴ ʙᴜᴛᴛᴏɴs.
/cancel - ᴄᴀɴᴄᴇʟ ᴛʜɪs ᴘʀᴏᴄᴇss</b>"""

  SKIP_MSG = """<b>❪ sᴇᴛ ᴍᴇssᴀɢᴇ sᴋɪᴘɪɴɢ ɴᴜᴍʙᴇʀ ❫</b>

<b>sᴋɪᴘ ᴛʜᴇ ᴍᴇssᴀɢᴇ ᴀs ᴍᴜᴄʜ ᴀs ʏᴏᴜ ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴜᴍʙᴇʀ ᴀɴᴅ ᴛʜᴇ ʀᴇsᴛ ᴏꜰ ᴛʜᴇ ᴍᴇssᴀɢᴇ ᴡɪʟʟ ʙᴇ ꜰᴏʀᴡᴀʀᴅᴇᴅ
ᴅᴇꜰᴀᴜʟᴛ sᴋɪᴘ ɴᴜᴍʙᴇʀ =</b> <code>0</code>
<code>ᴇɢ:ɪꜰ ʏᴏᴜ ᴇɴᴛᴇʀ 5, 5 ᴍᴇssᴀɢᴇs ᴡɪʟʟ ʙᴇ sᴋɪᴘᴇᴅ</code>
/cancel <b>- ᴄᴀɴᴄᴇʟ ᴛʜɪs ᴘʀᴏᴄᴇss</b>"""

  CANCEL = """<b>ᴘʀᴏᴄᴇss ᴄᴀɴᴄᴇʟʟᴇᴅ sᴜᴄᴄᴇꜰᴜʟʟʏ !</b>"""

  BOT_DETAILS = """<b><u>📄 ʙᴏᴛ ᴅᴇᴛᴀɪʟs</u></b>

<b>➣ ɴᴀᴍᴇ:</b> <code>{}</code>
<b>➣ ꜰᴏʀᴡᴀʀᴅ ɪᴅ:</b> <code>{}</code>
<b>➣ ᴜsᴇʀɴᴀᴍᴇ:</b> @{}</b>"""

  USER_DETAILS = """<b><u>📄 ᴜsᴇʀʙᴏᴛ ᴅᴇᴛᴀɪʟs</u></b>

<b>➣ ɴᴀᴍᴇ:</b> <code>{}</code>
<b>➣ ᴜsᴇʀ ɪᴅ:</b> <code>{}</code>
<b>➣ ᴜsᴇʀɴᴀᴍᴇ:</b> @{}"""

  
  TEXTs = """<b>━━━━━ ❰ ꜰᴏʀᴡᴀʀᴅ sᴛᴀᴛᴜs ❱ ━━━━━</b>
<b>🕵 ꜰᴇᴛᴄʜᴇᴅ ᴍsɢ :</b> <code>{}</code>

<b>✅ sᴜᴄᴄᴇssꜰᴜʟʟʏ ꜰᴡᴅ :</b> <code>{}</code>

<b>👥 ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴍsɢ :</b> <code>{}</code>

<b>🗑 ᴅᴇʟᴇᴛᴇᴅ ᴍsɢ :</b> <code>{}</code>

<b>🪆 sᴋɪᴘᴘᴇᴅ ᴍsɢ :</b> <code>{}</code>

<b>🔁 ꜰɪʟᴛᴇʀᴇᴅ ᴍsɢ :</b> <code>{}</code>

<b>📊 ᴄᴜʀʀᴇɴᴛ sᴛᴀᴛᴜs:</b> <code>{}</code>

<b>𖨠 ᴘᴇʀᴄᴇɴᴛᴀɢᴇ:</b> <code>{}</code> %

<b>━━━━━━ ❰ {} ❱ ━━━━━━</b>"""


  TEXT = """<b>━━━━━ ❰ ꜰᴏʀᴡᴀʀᴅ sᴛᴀᴛᴜs ❱ ━━━━━</b>

<b>📊 ᴛᴏᴛᴀʟ ᴍᴇssᴀɢᴇs :</b>   <code>{}</code>

<b>📥 ꜰᴇᴛᴄʜᴇᴅ         :</b>   <code>{}</code>
<b>🔁 ꜰᴏʀᴡᴀʀᴅᴇᴅ    :</b>   <code>{}</code>
<b>⏳ ʀᴇᴍᴀɪɴɪɴɢ     :</b>   <code>{}</code>

<b>🟣 ᴅᴜᴘʟɪᴄᴀᴛᴇs   :</b>   <code>{}</code>
<b>🗑️ ᴅᴇʟᴇᴛᴇᴅ         :</b>   <code>{}</code>
<b>⛔ sᴋɪᴘᴘᴇᴅ         :</b>   <code>{}</code>
<b>🔎 ꜰɪʟᴛᴇʀᴇᴅ        :</b>   <code>{}</code>

<b>⚙️ ᴄᴜʀʀᴇɴᴛ sᴛs    :</b>   <code>{}</code>
<b>🕒 ᴇsᴛ ᴛɪᴍᴇ        :</b>   <code>{}</code>

<blockquote><b>🆔 ꜰᴏʀᴡᴀʀᴅ ɪᴅ   :</b>   <b>{}</b> 
<b>🤖 ʙᴏᴛ ɴᴀᴍᴇ       :</b>   <code>{}</code>
<b>📤 ꜰʀᴏᴍ              :</b>   <code>{}</code>
<b>📥 ᴛᴏ                   :</b>   <code>{}</code></blockquote>

<b>━━━━━━ ❰ {} ❱ ━━━━━━</b>"""





  DUPLICATE_TEXT = """<b>━━━━━ ❰ ᴜɴᴇǫᴜɪꜰʏ sᴛᴀᴛᴜs ❱ ━━━━━</b>

<b>ꜰᴇᴛᴄʜᴇᴅ ꜰɪʟᴇs:</b> <code>{}</code>

<b>ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴅᴇʟᴇᴛᴇᴅ:</b> <code>{}</code> 

<b>━━━━━━ ❰ {} ❱ ━━━━━━</b>"""


  DOUBLE_CHECK = """<b><u>ᴅᴏᴜʙʟᴇ ᴄʜᴇᴄᴋɪɴɢ ⚠️</u></b>
<i>ʙᴇꜰᴏʀᴇ ꜰᴏʀᴡᴀʀᴅɪɴɢ ᴛʜᴇ ᴍᴇssᴀɢᴇs, ᴄʟɪᴄᴋ ᴛʜᴇ "ʏᴇs" ʙᴜᴛᴛᴏɴ ᴏɴʟʏ ᴀꜰᴛᴇʀ ᴠᴇʀɪꜰʏɪɴɢ ᴛʜᴇ ꜰᴏʟʟᴏᴡɪɴɢ:</i>

<blockquote><b>ʏᴏᴜʀ ʙᴏᴛ:</b> [{botname}](t.me/{botuname})
<b>ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ:</b> `{from_chat}`
<b>ᴛᴏ ᴄʜᴀɴɴᴇʟ:</b> `{to_chat}`
<b>sᴋɪᴘ ᴍᴇssᴀɢᴇs:</b> `{skip}`</blockquote>

<blockquote>° [{botname}](t.me/{botuname}) ᴍᴜsᴛ ʙᴇ ᴀɴ ᴀᴅᴍɪɴ ɪɴ ᴛʜᴇ ᴛᴀʀɢᴇᴛ ᴄʜᴀᴛ <b>(`{to_chat}`)</b>
° ɪꜰ ᴛʜᴇ **sᴏᴜʀᴄᴇ ᴄʜᴀᴛ** ɪs ᴘʀɪᴠᴀᴛᴇ, ʏᴏᴜʀ ᴜsᴇʀʙᴏᴛ ᴍᴜsᴛ ʙᴇ ᴀ ᴍᴇᴍʙᴇʀ ᴏʀ ʏᴏᴜʀ ʙᴏᴛ ᴍᴜsᴛ ʙᴇ ᴀɴ ᴀᴅᴍɪɴ ᴛʜᴇʀᴇ ᴀs ᴡᴇʟʟ</blockquote>

<b>ɪꜰ ᴛʜᴇ ᴀʙᴏᴠᴇ ᴄᴏɴᴅɪᴛɪᴏɴs ᴀʀᴇ ᴍᴇᴛ, ᴛʜᴇɴ ᴄʟɪᴄᴋ ᴛʜᴇ "ʏᴇs" ʙᴜᴛᴛᴏɴ</b>"""
  
  SETTINGS_TXT = """<b>ᴄʜᴀɴɢᴇ ʏᴏᴜʀ sᴇᴛᴛɪɴɢs ᴀs ʏᴏᴜʀ ᴡɪsʜ</b>"""